In [1]:
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import pandas as pd

In [10]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
df = pd.read_csv(url, sep = '\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [11]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [29]:
#Which was the most ordered item? and How many items were ordered
item = df.groupby('item_name').sum()
item.head()

                       order_id  quantity
item_name
6 Pack Soft Drink         52322        55
Barbacoa Bowl             53972        66
Barbacoa Burrito          74718        91
Barbacoa Crispy Tacos      5613        12
Barbacoa Salad Bowl        9708        10

In [32]:
maxim =item['quantity'].max()
max_qty = item[item['quantity']==maxim]
max_qty

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [ ]:
#What was the most ordered item in the choice_description column?

In [33]:
item = df.groupby('choice_description').sum()
item.head()

                                                    order_id  quantity
choice_description
[Adobo-Marinated and Grilled Chicken, Pinto Bea...       214         1
[Adobo-Marinated and Grilled Chicken, [Sour Cre...       279         1
[Adobo-Marinated and Grilled Chicken]                    217         1
[Adobo-Marinated and Grilled Steak, [Sour Cream...       279         1
[Adobo-Marinated and Grilled Steak]                      217         1

In [34]:
maxim =item['quantity'].max()
max_qty = item[item['quantity']==maxim]
max_qty

                    order_id  quantity
choice_description
[Diet Coke]           123455       159